UB_Copy/src/Catalogs/УБ_ПоказателиЭффективности/УБ_ПоказателиЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБ_ПоказателиЭффективности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВариантРасчетаЗначенияПлана</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаЗначенийПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаЗначенияФакта</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаЗначенийПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасценки</name>
    <type>
      <types>EnumRef.УБ_ВидыРасценокПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УБ_ЕдиницыИзмеренияПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндикаторЦелевогоПоказателя</name>
    <type>
      <types>EnumRef.УБ_ИндикаторЦелевогоПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНастройкуИзТипаПоказателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьФормулу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначениеРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеЗначениеРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НегативноеОтклонениеНормыДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьВРасчетеПерсональнойЭффективности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьМаксимальноеЗначениеРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьМинимальноеЗначениеРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИнструментовДляАнализа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПодсчетаФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеУстановкиПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасчета</name>
    <type>
      <types>EnumRef.УБ_ПериодичностьРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерспективаССП</name>
    <type>
      <types>CatalogRef.УБ_ПерспективыССП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПограничноеОтклонениеНормыДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПограничноеОтклонениеНормыОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаПоЗаполнениюКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПозитивноеОтклонениеНормыОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетаЗарплаты</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьПринадлежитПодразделению</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринадлежностьПоказателя</name>
    <type>
      <types>DefinedType.УБ_НазначенияПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьРезультатОтФакта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоказателя</name>
    <type>
      <types>EnumRef.УБ_СостоянияПоказателейЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначенияПоказателя</name>
    <comment>число/булево/строка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.УБ_ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.УБ_ТипыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Фиксированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуютНижестоящиеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПринадлежности</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаСбораДанных</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаСбораДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыИспользованияПоказателя</name>
    <attributes>
      <name>МесяцПрименения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВлияющиеПоказатели</name>
    <attributes>
      <name>ВлияющийПоказатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрекратилДействиеС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеПоказатели</name>
    <attributes>
      <name>ЗависимыйПоказатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрекратилДействиеС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрекратилДействиеЧекбокс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормулыРасчета</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UB_Copy/src/Catalogs/УБ_ПоказателиЭффективности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ТипПоказателя") Тогда
			ТипПоказателя = ДанныеЗаполнения.ТипПоказателя;
			ИспользоватьНастройкуИзТипаПоказателя = Не ТипПоказателя.Матричный;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		ЕдиницаИзмерения = Справочники.УБ_ЕдиницыИзмеренияПоказателей.рубли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтоГруппа Тогда
		
		Если НЕ ТипЗначенияПоказателя = "число" Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ЕдиницаИзмерения");				
		КонецЕсли;
		
		Если ТипПоказателя.Матричный
			Или ИспользоватьНастройкуИзТипаПоказателя Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПоказательРасчетаЗарплаты");
		КонецЕсли;
		
		Если ТипПоказателя.Матричный Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидРасценки");
		КонецЕсли;
		
		Если ОграничиватьМинимальноеЗначениеРезультата
			И ОграничиватьМаксимальноеЗначениеРезультата
			И МинимальноеЗначениеРезультата >= МаксимальноеЗначениеРезультата Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Минимальное значение результата должно быть меньше максимального'"),
				Ссылка,
				,
				,
				Отказ);
		КонецЕсли;
		
		// Проверка корректности идентификатора
		
		Для Позиция = 1 По СтрДлина(Идентификатор) Цикл
			Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Идентификатор, Позиция)) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Идентификатор содержит недопустимые символы'"),
					,
					"Объект.Идентификатор",
					,
					Отказ);	
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		КодПервогоСимвола = КодСимвола(Идентификатор, 1);
		Если КодПервогоСимвола >= 48 И КодПервогоСимвола <= 57 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Идентификатор не может начинаться с цифры'"),
				,
				"Объект.Идентификатор",
				,
				Отказ);
		КонецЕсли;
		
		ПоказательПоИдентификатору = УБ_РасчетПоказателейЭффективности.ПоказательЭффективностиПоИдентификатору(Идентификатор);
		Если ПоказательПоИдентификатору <> Неопределено
			И ПоказательПоИдентификатору <> Ссылка Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Показатель с идентификатором %1 уже существует'"), Идентификатор);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Идентификатор",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.УБ_ЗависимостиПоказателейЭффективности.ЗаполнитьЗависимостиПоказателей(ЗависимыеПоказатели, Ссылка);

КонецПроцедуры
	
Процедура ПриКопировании(ОбъектКопирования)
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаСтатусаГрейда()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
